
print('Укажите количество кустов:')
n = int(input()) # количество кустов
print('Укажите урожайность каждого куста:')
a = list(map(int, input().split())) # список урожайностей

max_harvest = 0 # максимальное количество ягод, которое можно собрать

for i in range(n):
    # считаем количество ягод, которое можно собрать с текущего куста и двух соседних
    harvest = a[i] + (a[i-1] if i > 0 else 0) + (a[i+1] if i < n-1 else 0)
    # обновляем максимальное количество ягод
    max_harvest = max(max_harvest, harvest)
print('Максимальный сбор:', max_harvest)